"""Programs API v1 constants."""

# Mapping of Type_of_Activity IDs to their descriptions in Arabic
TYPES_OF_ACTIVITY_MAPPING = {
    135: "التدريب - التدريب المباشر",
    155: "التدريب - التدريب الإلكتروني",
    165: "برنامج الاستثمار الأمثل (برامج قصيرة)",
    175: "برنامج الاستثمار الأمثل (برامج طويلة)",
    190: "الملتقيات - المؤتمرات",
    195: "الملتقيات - اللقاءات التربوية",
    200: "الملتقيات - المحاضرات",
    205: "الملتقيات - الندوات",
    270: "التعلم التشاركي - الزيارات الميدانية",
    55: "ورش العمل - ورش العمل",
    65: "التعلم التشاركي - الدروس التطبيقية",
    75: "التعلم التشاركي - دورة بحث الدرس"
}
